[
  {
    "titulo": "La secretaria de Agricultura estadounidense visita México para avanzar en la",
    "resumen": "Here's a summary of the press release in approximately 120 words:\n\nU.S. Agriculture Secretary Brooke Rollins visited Mexico to discuss strategies against the Cattle Screwworm (GBG) pest. She met with Mexican officials, including President Claudia Sheinbaum and Agriculture Secretary Julio Berdegué, at Senasica offices and Palacio Nacional. The visit aimed to strengthen bilateral coordination on animal health and explore collaboration within the USMCA framework. The U.S. closed its border with Mexico four months ago due to the GBG threat. Both countries have invested significantly in addressing the issue, with the USDA committing $21 million to renovate sterile fly facilities in Chiapas and Texas. From November 2024 to August 2025, the sanitary deployment cost reached 1,128 million pesos, with an estimated 700,880 cattle heads unable to be exported, representing $642 million in lost revenue."
  },
  {
    "titulo": "US not ready to lift Mexican cattle ban over screwworm, Agriculture Secretary",
    "resumen": "Here's a summary of the press release in approximately 130 words:\n\nU.S. Agriculture Secretary Brooke Rollins says the United States is not yet ready to reopen its border to Mexican cattle due to a New World screwworm parasite outbreak. Despite the border being largely closed since May, Rollins is pleased with Mexico's containment efforts and considers this a highly collaborative effort between agricultural departments. She noted 11 contained screwworm cases in Mexican border states and emphasized the importance of preventing the parasite from entering the U.S. southern border. The outbreak has significant economic implications, potentially causing $1.8 billion in damage to Texas alone. Approximately 250,000 cattle are currently waiting to enter the U.S. Rollins stressed that safety takes precedence over economic considerations and that premature border reopening could lead to more substantial future costs if the screwworm spreads."
  },
  {
    "titulo": "A Mayor’s Assassination Reignites Mexico’s Debate Over Confronting Cartels",
    "resumen": "Here's a summary of the press release in approximately 130 words:\n\nMexican Mayor Carlos Manzo, known for his confrontational approach against criminal gangs in Uruapan, was assassinated during a Day of the Dead ceremony. Manzo, who received 65% of local election votes, had been vocal about challenging criminal organizations and criticizing President Claudia Sheinbaum's \"hugs, not bullets\" strategy. His murder sparked widespread protests in Michoacán, with thousands demanding government action against cartels. Sheinbaum rejected returning to militarized anti-drug strategies and defended her current approach of using intelligence to combat crime. The U.S. has offered security cooperation, which Sheinbaum partially accepted while rejecting direct intervention. The assassination highlighted the ongoing challenges of organized crime in Mexico and the growing frustration with current security policies. The killer, believed to be cartel-affiliated, was shot dead by Manzo's bodyguard."
  },
  {
    "titulo": "Un atentado con el sello del Cartel Jalisco, un pistolero suicida y un gobernador",
    "resumen": "Here's a summary of the press release in approximately 120 words:\n\nThe assassination of Carlos Manzo, mayor of Uruapan, Michoacán, is believed to be orchestrated by the Jalisco Cartel (CJNG) in retaliation for the arrest of their leader René Belmonte in August. A young gunman, aged 17-19, carried out the attack during Day of the Dead celebrations and was killed immediately after. Sources suggest the federal government is dissatisfied with Michoacán's governor, Alfredo Ramírez Bedolla, for his perceived lack of commitment to addressing regional violence. The attack highlights ongoing tensions between local authorities and criminal groups, with the CJNG targeting small and medium farmers through extortion. The federal government plans to have Manzo's widow temporarily replace him as municipal president to maintain administrative continuity."
  }
]